[
    {
        "term": "Accuracy",
        "definition": "Model accuracy is the probability that a neural network will classify images correctly."
    },
    {
        "term": "Activation function",
        "definition": "Activation functions are mathematical equations that determine the output of a neural network. The function is attached to each neuron in the network, and determines whether it should be activated or not, based on whether each neuron's input is relevant for the model's prediction."
    },
    {
        "term": "Architecture",
        "definition": "The model architecture is the combination of layers used to assemble a neural network."
    },
    {
        "term": "Biases",
        "definition": "Additional numbers used in both types of layers that are used to regulate the filters/weights. They are used to allow the output to go through the activation function when needed."
    },
    {
        "term": "Convolutional layers",
        "definition": "Set of filters (2D matrices) that receive a 2D matrix as an input, and the output is the convolution between the input and the filters."
    },
    {
        "term": "Convolution",
        "definition": "Mathematical operation that involves two 2D matrices where each number is multiplied by the corresponding number in the other matrix. E.g. New matrix at row 4, column 5 = Matrix A at row 4, column 5 * Matrix B at row 4, column 5"
    },
    {
        "term": "Dataset",
        "definition": "A dataset is a collection of data used to train a neural network."
    },
    {
        "term": "Dropout",
        "definition": "Dropout is a technique used to prevent a model from overfitting. Dropout works by randomly setting the outgoing edges of hidden units (neurons that make up hidden layers) to 0 at each update of the training phase."
    },
    {
        "term": "Epoch",
        "definition": "An epoch is a single cycle of training through the full training dataset."
    },
    {
        "term": "Feature map",
        "definition": "Feature maps are generated by applying filters to the input image. They are visualisations of the features a filter is collecting. One filter could be looking for paws, others could be looking for fur."
    },
    {
        "term": "Filters",
        "definition": "Filters are 2D matrices used in convolutional layers."
    },
    {
        "term": "Filter size",
        "definition": "The size of the matrix. Only possible values are 3, 5 and 7 (3x3, 5x5, 7x7)"
    },
    {
        "term": "Fully-connected layers",
        "definition": "Set of scalars (real number) that are used to multiply the input (image) by themselves to result in an output that will classify the input into well-defined categories."
    },
    {
        "term": "Learning rate",
        "definition": "The learning rate is a variable that controls how much to change the weights in response to the estimated error each time the model weights are updated."
    },
    {
        "term": "Loss",
        "definition": "Loss is a number indicating how bad the model's prediction was on a sample (image)."
    },
    {
        "term": "Machine learning",
        "definition": "Machine learning is a form of AI that enables a system to learn from data rather than through explicit instructions."
    },
    {
        "term": "Max pooling",
        "definition": "A type of pooling which replaces small grids inside a matrix with the maximum number."
    },
    {
        "term": "Neural network",
        "definition": "A neural network is a system of hardware or softwares, that resembles the neurons in the human brain. Basically, it helps computers think and learn like humans."
    },
    {
        "term": "Neuron",
        "definition": "In the context of machine learning, a neuron is a scalar, or a matrix which processes data in order to achieve networks. Layers are sets of neurons."
    },
    {
        "term": "Optimiser",
        "definition": "Optimisers are algorithms or methods used to change the attributes of the neural network such as weights and learning rate to reduce the losses. Optimisers are used to solve optimisation problems by minimising the function."
    },
    {
        "term": "Overfitting",
        "definition": "The model has been overfitted when it has learned too much from the training data and cannot generalise data it has never seen before."
    },
    {
        "term": "Padding",
        "definition": "Padding is the process of adding zeroes to the sides of an input image to make the sides less important. Valid - no padding, Same - adaptive padding"
    },
    {
        "term": "Prediction",
        "definition": "A prediction is the network's outcome for a single sample."
    },
    {
        "term": "Pooling",
        "definition": "There are multiple types of pooling, but they all do the same thing, reduce the number of values inside an output matrix after it has been convoluted. Sizes allowed are 1, 2, 4, 6 and 8."
    },
    {
        "term": "Stride",
        "definition": "Stride is the number of pixels shifts over the input matrix. When the stride is 1 then we move the filters to 1 pixel at a time. When the stride is 2 then we move the filters to 2 pixels at a time and so on."
    }
]